IDEA StatiCa Open Model
EffectConsideredType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Effect concidered types
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum EffectConsideredType
Public Enumeration EffectConsideredType
public enum class EffectConsideredType
Members
Member name | Value | Description
IsolatedMember | 0 |  Isolated system
BracingSystem | 1 |  Bracing system
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace